Repository: sergkarpenko/nhibernate-doc
Catalog: locale/*/LC_MESSAGES/preface.po
Languages: ru

source: Preface
ru: Предисловие

source: Working with object-oriented software and a relational database can be cumbersome and time consuming in today's enterprise environments. NHibernate is an object/relational mapping tool for .NET environments. The term object/relational mapping (ORM) refers to the technique of mapping a data representation from an object model to a relational data model with a SQL-based schema.
ru: Работа с объектно-ориентированным программным обеспечением и реляционной базой данных может быть объемной и затратной по времени в сегодняшних энтерпрайз окружениях. NHibernate - это инструмент объектно-реляционного отображения для .NET окружений. Термин объектно-ориентированное отражение (ORM) относится к технике отражения представления данных из объектной модели в реляционную модель данных, базируясь на SQL схеме.

source: NHibernate not only takes care of the mapping from .NET classes to database tables (and from .NET data types to SQL data types), but also provides data query and retrieval facilities and can significantly reduce development time otherwise spent with manual data handling in SQL and ADO.NET.
ru: NHibernate не только позволяет отражать .NET классы в таблицы баз данных (и .NET типы данных в типы данных SQL), но и предоставляет запросы данных, поисковые средства и дает возможность значительно сократить время разработки, как правило, затрачиваемое на ручную работу с SQL и ADO.NET.

source: NHibernate's goal is to relieve the developer from 95 percent of common data persistence related programming tasks. NHibernate may not be the best solution for data-centric applications that only use stored-procedures to implement the business logic in the database, it is most useful with object-oriented domain models and business logic in the .NET-based middle-tier. However, NHibernate can certainly help you to remove or encapsulate vendor-specific SQL code and will help with the common task of result set translation from a tabular representation to a graph of objects.
ru: Цель NHibernate - освободить разработчика от 95 процентов задач, связанных с общими вопросами обработки данных. NHibernate может быть не лучшим решением для приложений, ориентированных на данные, которые используют только хранимые процедуры для реализации бизнес-логики в базе данных, что наиболее полезно для объектно-ориентированных доменных моделей и бизнес-логики в среднем уровне (middle-tier) .NET. Однако NHibernate несомненно может помочь вам удалить или инкапсулировать SQL конкретного производителя и поможет с общей задачей преобразования результирующего набора из табличного в граф объектов.

source: If you are new to NHibernate and Object/Relational Mapping or even .NET Framework, please follow these steps:
ru: Если вы новичок в NHibernate и ORM или даже в .NET Framework, пожалуйста, следуйте следующим шагам:

source: Read :ref:`quickstart` for a 30 minute tutorial, using Internet Information Services (IIS) web server.
ru: Прочитайте :ref:`quickstart` тридцатиминутный учебник, использующий Internet Information Services (IIS) веб сервер.

source: Read :ref:`architecture` to understand the environments where NHibernate can be used.
ru: Прочитайте :ref:`architecture`, чтобы понять где NHibernate может быть использован.

source: Use this reference documentation as your primary source of information. Consider reading *Hibernate in Action* (java `http://www.manning.com/bauer/ <http://www.manning.com/bauer/>`_) or *NHibernate in Action* (`http://www.manning.com/kuate/ <http://www.manning.com/kuate/>`_) or *NHibernate 3.0 Cookbook* (`https://www.packtpub.com/nhibernate-3-0-cookbook/book <https://www.packtpub.com/nhibernate-3-0-cookbook/book>`_) or *NHibernate 2 Beginner's Guide* (`http://www.packtpub.com/nhibernate-2-x-beginners-guide/book <http://www.packtpub.com/nhibernate-2-x-beginners-guide/book>`_)if you need more help with application design or if you prefer a step-by-step tutorial. Also visit `http://nhibernate.sourceforge.net/NHibernateEg/ <http://nhibernate.sourceforge.net/NHibernateEg/>`_ for NHibernate tutorial with examples.
ru: Используйте следующую документацию как основной источник информации. Прочитайте *Hibernate in Action* (java `http://www.manning.com/bauer/ <http://www.manning.com/bauer/>`_) или *NHibernate in Action* (`http://www.manning.com/kuate/ <http://www.manning.com/kuate/>`_) или *NHibernate 3.0 Cookbook* (`https://www.packtpub.com/nhibernate-3-0-cookbook/book <https://www.packtpub.com/nhibernate-3-0-cookbook/book>`_) или *NHibernate 2 Beginner's Guide* (`http://www.packtpub.com/nhibernate-2-x-beginners-guide/book <http://www.packtpub.com/nhibernate-2-x-beginners-guide/book>`_) если вам нужно больше помощи с дизайном приложения или вы отдаете предпочтение пошаговому учебнику. Также посетите `http://nhibernate.sourceforge.net/NHibernateEg/ <http://nhibernate.sourceforge.net/NHibernateEg/>`_ NHibernate учебник с примерами.

source: FAQs are answered on the `NHibernate users group <http://groups.google.com/group/nhusers>`_.
ru: FAQ на `NHibernate users group <http://groups.google.com/group/nhusers>`_.

source: The Community Area on the `NHibernate website <http://www.nhforge.org/>`_ is a good source for design patterns and various integration solutions (ASP.NET, Windows Forms).
ru: Community раздел на `NHibernate website <http://www.nhforge.org/>`_ - это хороший ресурс с шаблонами проектирования и различными интеграционным решениями (ASP.NET, Windows Forms).

source: If you have questions, use the `NHibernate user forum <http://groups.google.com/group/nhusers>`_. We also provide a `JIRA issue trackings system <http://jira.nhforge.org/>`_ for bug reports and feature requests. If you are interested in the development of NHibernate, join the developer mailing list. If you are interested in translating this documentation into your language, contact us on the `developer mailing list <http://groups.google.com/group/nhibernate-development>`_.
ru: Если у вас есть вопросы, используйте `NHibernate user forum <http://groups.google.com/group/nhusers>`_. Мы также предоставляем `JIRA issue trackings system <http://jira.nhforge.org/>`_ для баг репортаж и фиче реквестов, Если вы интересуетесь разработкой NHibernate, присоединяйтесь к списку рассылки разработчиков. Если вы заинтересованы в переводе документации на ваш язык, свяжитесь с нами в списке рассылки `список рассылки разработчиков <http://groups.google.com/group/nhibernate-development>`_.
